#+TITLE: Aula 1 - Java

** 2.3 CÓDIGO-FONTE DE UM PROGRAMA SIMPLES EM JAVA
Agora, vamos conhecer nosso primeiro código em Java! Um exemplo clássico, usado no ensino de linguagens de programação, é o “Hello World” (que significa "Olá Mundo"). Neste exemplo, é dado ao aluno um código-fonte bem pequeno, contendo apenas a estrutura suficiente para mostrar a mensagem "Hello World!" em tela. Observe o código do programa escrito em Java:


#+begin_src java
public class HelloWorld {
     public static void main(String[] args) {
          System.out.println("Hello World");
     }
}
#+end_src

#+RESULTS:
: Hello World

Em breve, estudaremos a fundo as características dos programas Java. Por enquanto, considere apenas que programas Java são formados por unidades de código-fonte chamadas de *classes*.

Estas, por sua vez, são formadas por *variáveis* e *métodos (funções)*. No código, a linha 1 define o nome da classe com a palavra-chave /“class”/ seguida de /“HelloWorld”/. Assim, nossa classe se chamará /HelloWorld/.

A palavra-chave /“public”/, no início da linha 1, está definindo que nossa classe é *pública*. Estudaremos mais sobre isso nas próximas aulas, mas, por enquanto, é importante que você saiba que *classes públicas devem estar dentro de arquivos com o mesmo nome que elas*. Assim, o arquivo que contém o código-fonte do exemplo mostrado deve, necessariamente, se chamar HelloWorld.java.

A linha 2 do programa corresponde a um método chamado *Main*. Ele é o método principal de uma classe Java. Quando a JVM tentar executar um programa Java, irá procurar o método Main para executar as instruções contidas nele. No nosso caso, temos apenas a instrução /System.out.println/. Considere que /System.out.println/ faça o mesmo trabalho que a função Escrever, que estudamos em algoritmos, ou seja, ela exibe uma mensagem em tela. Assim, quando essa instrução for executada, o texto Hello World! será exibido.

Você deve ter percebido que, antes do método Main, temos diversas outras palavras-chave: *public*, *static*, *void* e *String args[]* entre parênteses. O conjunto dessas palavras-chave juntamente com o nome “main" constitui o que chamamos de *assinatura do método*. A partir da assinatura de um método, podemos saber seu nome, que tipos de dados ele retorna como resultado do seu trabalho e que variáveis ele precisa receber para trabalhar. Você aprenderá mais sobre a assinatura de um método durante o curso.

 - Nem todas as classes Java possuem método Main. As classes que não possuem esse método não podem ser executadas, tendo outras funcionalidades, como prover aplicabilidades auxiliares a classes executáveis.

Um detalhe interessante que já podemos analisar na assinatura do método Main é o que chamamos de parâmetros. Um método pode receber uma lista de parâmetros, variáveis que contêm valores necessários para efetuar o trabalho do método. Esses parâmetros sempre vêm entre parênteses, depois do nome do método. No caso do método Main cujo conceito discutimos nesta aula, a variável String args[] é o único parâmetro, sendo “args” uma variável do tipo vetor (por isso o símbolo "[]") de String. String é um tipo de dado de texto em Java. Na nossa classe HelloWorld, não usamos a variável args[], mas perceberemos sua utilidade nos exemplos futuros.

Para finalizar, analisaremos como os programas em Java marcam o limite entre blocos de código. Percebeu os pares de chaves, *{* e *}*, dentro do código? Eles são *delimitadores de bloco*. Isso significa que o código que está dentro de um mesmo par de chaves compõe um bloco. Blocos podem estar um dentro dos outros. Por exemplo, o método Main é um bloco de código (está entre chaves), que, por sua vez, está dentro do bloco da classe HelloWorld, que também possui seu par de chaves. Diferentemente dos pseudocódigos em Portugol, que usamos até então, em Java, é necessário usar esses pares de chaves para delimitar os limites de cada bloco de código. Estudaremos isso com mais detalhes futuramente.

Neste tópico, conhecemos os conceitos da Plataforma Java e pudemos entender os mecanismos do seu funcionamento. Também conhecemos as funcionalidades e a estrutura de um programa simples em Java. No próximo tópico, aprenderemos algumas regras de sintaxe da Linguagem Java e descobriremos como realizar as atividades de programação Java (Oficinas) no ambiente de programação da plataforma. Até lá!

